import hashlib
import json
import os
import copy

symbol = "688012.SH"
exp_path = "aaaaaaa"
data = {
    "data_config": {
        # aaaaaa
        {
            "策略标的": "688012.SH",
            "交易时间": "093201-113000,130001-145700",
            "尾盘对冲时间": "145600",
            "午盘撤单时间": "112950",
            "交易账户": "801c",
            "对冲周期(秒)": 1,
            "信号下单周期(秒)": 1,
            "全局撤单重试时间(秒)": 1,
            "信号开仓基准": "盘口中间价",
            "单笔委托最大量(股)": 50000,
            "信号基准价偏移比例": 0,
            "基准价格偏移方向": "向上",
            "对报价进行涨跌停限制": "是",
            "异常控制措施": "无",
            "铺单模式是否考虑靠档": "否",
            "是否启用增强tick": "否",
            "订单指向模式": "自行下单",
            "子策略的优先级": "子策略高优先级",
            "订阅主策略类型": "STARNewStrategy",
            "是否启动纯净盘口": "启动",
            "模式开关控制": [
                {
                    "是否启动对冲开关": "是",
                    "是否启动信号因子套利开关": "是"
                }
            ],
            "对冲模式": [
                {
                    "敞口轧差模式": "时间最前",
                    "对冲单是否靠档": "对冲止盈单靠档",
                    "对冲模式下止盈单盈利金额": 0,
                    "单笔持仓上限对冲时间": 300,
                    "单笔总价止盈判定": 1000,
                    "单笔总价止损判定": -1000,
                    "单价止盈率": 0.003,
                    "单价止损率": -0.005,
                    "中间价最优止损率": null,
                    "抢跑机制下一档数量": 50000,
                    "最新主动买卖价时间设置": 10,
                    "最优档掩埋再次下单周期": 10,
                    "最优档掩埋抬价次数上限": 3,
                    "最优一档的Tick金额": 0.01,
                    "买交易费率": 0.001,
                    "卖交易费率": 0.001,
                    "趋势预测阈值": 0.001,
                    "波动率计算窗口(s)": 60,
                    "主动成交时未成交撤单时间(s)": 10
                }
            ],
            "异常废单处理": [
                {
                    "废单总次数上限": 200,
                    "滑窗废单次数": 40,
                    "滑窗时间": 10,
                    "单笔对敲重复申报次数": 3,
                    "降档次数": 3,
                    "拉抬废单转换时间": 10,
                    "单笔撤单上限": 10,
                    "单笔下单上限": 10
                }
            ],
            "事件应对机制": [
                {
                    "接近行情涨跌停价比例": 0.02,
                    "达到涨跌停价比例": 0.002,
                    "单边成交最大控制": 5000,
                    "股价异常波动_幅度": 0.01,
                    "股价异常波动_窗口时间(秒)": 180,
                    "禁止敞口数量": 600,
                    "铺单模式下敞口控制": 600,
                    "零股卖单控制上限": 10
                }
            ],
            "信号参数设置": [
                {
                    "订阅铺单信号策略类型": "OnnxTest",
                    "是否启动趋势AI铺单信号": "趋势AI铺单信号",
                    "是否进行信号的前后一致性判断": "否",
                    "铺单指定的类型": "OnnxTest",
                    "铺单抢订的最优一档的tick个数": 2,
                    "信号失效时间": 20,
                    "是否启动浮亏控制": "否"
                }
            ],
            "信号套利模式": [
                {
                    "模式档位名称": "卖五",
                    "平衡模式数量(股)": 0,
                    "平衡模式距离基准最小距离": 0.005,
                    "平衡模式波动容忍价格": 0.002,
                    "平衡模式止盈单止盈率": 0,
                    "轻微偏向买数量(股)": 0,
                    "轻微偏向买距离基准最小距离": 0.005,
                    "轻微偏向买波动容忍价格": 0,
                    "轻微偏向买止盈单止盈率": 0,
                    "轻微偏向卖数量(股)": 0,
                    "轻微偏向卖距离基准最小距离": 0.005,
                    "轻微偏向卖波动容忍价格": 0,
                    "轻微偏向卖止盈单止盈率": 0,
                    "强烈偏向买数量(股)": 0,
                    "强烈偏向买距离基准最小距离": 0.005,
                    "强烈偏向买波动容忍价格": 0,
                    "强烈偏向买止盈单止盈率": 0,
                    "强烈偏向卖数量(股)": 0,
                    "强烈偏向卖距离基准最小距离": 0.005,
                    "强烈偏向卖波动容忍价格": 0,
                    "强烈偏向卖止盈单止盈率": 0
                },
                {
                    "模式档位名称": "卖四",
                    "平衡模式数量(股)": 0,
                    "平衡模式距离基准最小距离": 0.004,
                    "平衡模式波动容忍价格": 0.002,
                    "平衡模式止盈单止盈率": 0,
                    "轻微偏向买数量(股)": 0,
                    "轻微偏向买距离基准最小距离": 0.004,
                    "轻微偏向买波动容忍价格": 0,
                    "轻微偏向买止盈单止盈率": 0,
                    "轻微偏向卖数量(股)": 0,
                    "轻微偏向卖距离基准最小距离": 0.004,
                    "轻微偏向卖波动容忍价格": 0,
                    "轻微偏向卖止盈单止盈率": 0,
                    "强烈偏向买数量(股)": 0,
                    "强烈偏向买距离基准最小距离": 0.004,
                    "强烈偏向买波动容忍价格": 0,
                    "强烈偏向买止盈单止盈率": 0,
                    "强烈偏向卖数量(股)": 0,
                    "强烈偏向卖距离基准最小距离": 0.004,
                    "强烈偏向卖波动容忍价格": 0,
                    "强烈偏向卖止盈单止盈率": 0
                },
                {
                    "模式档位名称": "卖三",
                    "平衡模式数量(股)": 200,
                    "平衡模式距离基准最小距离": 0.003,
                    "平衡模式波动容忍价格": 0.05,
                    "平衡模式止盈单止盈率": 0,
                    "轻微偏向买数量(股)": 0,
                    "轻微偏向买距离基准最小距离": 0.003,
                    "轻微偏向买波动容忍价格": 0,
                    "轻微偏向买止盈单止盈率": 0,
                    "轻微偏向卖数量(股)": 0,
                    "轻微偏向卖距离基准最小距离": 0.003,
                    "轻微偏向卖波动容忍价格": 0,
                    "轻微偏向卖止盈单止盈率": 0,
                    "强烈偏向买数量(股)": 0,
                    "强烈偏向买距离基准最小距离": 0.003,
                    "强烈偏向买波动容忍价格": 0,
                    "强烈偏向买止盈单止盈率": 0,
                    "强烈偏向卖数量(股)": 0,
                    "强烈偏向卖距离基准最小距离": 0.003,
                    "强烈偏向卖波动容忍价格": 0,
                    "强烈偏向卖止盈单止盈率": 0
                },
                {
                    "模式档位名称": "卖二",
                    "平衡模式数量(股)": 0,
                    "平衡模式距离基准最小距离": 0.002,
                    "平衡模式波动容忍价格": 0.1,
                    "平衡模式止盈单止盈率": 0,
                    "轻微偏向买数量(股)": 0,
                    "轻微偏向买距离基准最小距离": 0.002,
                    "轻微偏向买波动容忍价格": 0,
                    "轻微偏向买止盈单止盈率": 0,
                    "轻微偏向卖数量(股)": 0,
                    "轻微偏向卖距离基准最小距离": 0.002,
                    "轻微偏向卖波动容忍价格": 0,
                    "轻微偏向卖止盈单止盈率": 0,
                    "强烈偏向买数量(股)": 0,
                    "强烈偏向买距离基准最小距离": 0.002,
                    "强烈偏向买波动容忍价格": 0,
                    "强烈偏向买止盈单止盈率": 0,
                    "强烈偏向卖数量(股)": 0,
                    "强烈偏向卖距离基准最小距离": 0.002,
                    "强烈偏向卖波动容忍价格": 0,
                    "强烈偏向卖止盈单止盈率": 0
                },
                {
                    "模式档位名称": "卖一",
                    "平衡模式数量(股)": 0,
                    "平衡模式距离基准最小距离": 0.001,
                    "平衡模式波动容忍价格": 0.002,
                    "平衡模式止盈单止盈率": 0,
                    "轻微偏向买数量(股)": 0,
                    "轻微偏向买距离基准最小距离": 0.001,
                    "轻微偏向买波动容忍价格": 0,
                    "轻微偏向买止盈单止盈率": 0,
                    "轻微偏向卖数量(股)": 200,
                    "轻微偏向卖距离基准最小距离": -0.5,
                    "轻微偏向卖波动容忍价格": 1,
                    "轻微偏向卖止盈单止盈率": 0.003,
                    "强烈偏向买数量(股)": 0,
                    "强烈偏向买距离基准最小距离": 0.001,
                    "强烈偏向买波动容忍价格": 0,
                    "强烈偏向买止盈单止盈率": 0,
                    "强烈偏向卖数量(股)": 300,
                    "强烈偏向卖距离基准最小距离": -0.5,
                    "强烈偏向卖波动容忍价格": 1,
                    "强烈偏向卖止盈单止盈率": 0.004
                },
                {
                    "模式档位名称": "买一",
                    "平衡模式数量(股)": 0,
                    "平衡模式距离基准最小距离": 0.001,
                    "平衡模式波动容忍价格": 0.002,
                    "平衡模式止盈单止盈率": 0,
                    "轻微偏向买数量(股)": 200,
                    "轻微偏向买距离基准最小距离": -0.5,
                    "轻微偏向买波动容忍价格": 1,
                    "轻微偏向买止盈单止盈率": 0.003,
                    "轻微偏向卖数量(股)": 0,
                    "轻微偏向卖距离基准最小距离": 0.001,
                    "轻微偏向卖波动容忍价格": 0,
                    "轻微偏向卖止盈单止盈率": 0,
                    "强烈偏向买数量(股)": 300,
                    "强烈偏向买距离基准最小距离": -0.5,
                    "强烈偏向买波动容忍价格": 1,
                    "强烈偏向买止盈单止盈率": 0.004,
                    "强烈偏向卖数量(股)": 0,
                    "强烈偏向卖距离基准最小距离": 0.001,
                    "强烈偏向卖波动容忍价格": 0,
                    "强烈偏向卖止盈单止盈率": 0
                },
                {
                    "模式档位名称": "买二",
                    "平衡模式数量(股)": 0,
                    "平衡模式距离基准最小距离": 0.002,
                    "平衡模式波动容忍价格": 0.1,
                    "平衡模式止盈单止盈率": 0,
                    "轻微偏向买数量(股)": 0,
                    "轻微偏向买距离基准最小距离": 0.002,
                    "轻微偏向买波动容忍价格": 0,
                    "轻微偏向买止盈单止盈率": 0,
                    "轻微偏向卖数量(股)": 0,
                    "轻微偏向卖距离基准最小距离": 0.002,
                    "轻微偏向卖波动容忍价格": 0,
                    "轻微偏向卖止盈单止盈率": 0,
                    "强烈偏向买数量(股)": 0,
                    "强烈偏向买距离基准最小距离": 0.002,
                    "强烈偏向买波动容忍价格": 0,
                    "强烈偏向买止盈单止盈率": 0,
                    "强烈偏向卖数量(股)": 0,
                    "强烈偏向卖距离基准最小距离": 0.002,
                    "强烈偏向卖波动容忍价格": 0,
                    "强烈偏向卖止盈单止盈率": 0
                },
                {
                    "模式档位名称": "买三",
                    "平衡模式数量(股)": 200,
                    "平衡模式距离基准最小距离": 0.003,
                    "平衡模式波动容忍价格": 0.05,
                    "平衡模式止盈单止盈率": 0,
                    "轻微偏向买数量(股)": 0,
                    "轻微偏向买距离基准最小距离": 0.003,
                    "轻微偏向买波动容忍价格": 0,
                    "轻微偏向买止盈单止盈率": 0,
                    "轻微偏向卖数量(股)": 0,
                    "轻微偏向卖距离基准最小距离": 0.003,
                    "轻微偏向卖波动容忍价格": 0,
                    "轻微偏向卖止盈单止盈率": 0,
                    "强烈偏向买数量(股)": 0,
                    "强烈偏向买距离基准最小距离": 0.003,
                    "强烈偏向买波动容忍价格": 0,
                    "强烈偏向买止盈单止盈率": 0,
                    "强烈偏向卖数量(股)": 0,
                    "强烈偏向卖距离基准最小距离": 0.003,
                    "强烈偏向卖波动容忍价格": 0,
                    "强烈偏向卖止盈单止盈率": 0
                },
                {
                    "模式档位名称": "买四",
                    "平衡模式数量(股)": 0,
                    "平衡模式距离基准最小距离": 0.004,
                    "平衡模式波动容忍价格": 0.002,
                    "平衡模式止盈单止盈率": 0,
                    "轻微偏向买数量(股)": 0,
                    "轻微偏向买距离基准最小距离": 0.004,
                    "轻微偏向买波动容忍价格": 0,
                    "轻微偏向买止盈单止盈率": 0,
                    "轻微偏向卖数量(股)": 0,
                    "轻微偏向卖距离基准最小距离": 0.004,
                    "轻微偏向卖波动容忍价格": 0,
                    "轻微偏向卖止盈单止盈率": 0,
                    "强烈偏向买数量(股)": 0,
                    "强烈偏向买距离基准最小距离": 0.004,
                    "强烈偏向买波动容忍价格": 0,
                    "强烈偏向买止盈单止盈率": 0,
                    "强烈偏向卖数量(股)": 0,
                    "强烈偏向卖距离基准最小距离": 0.004,
                    "强烈偏向卖波动容忍价格": 0,
                    "强烈偏向卖止盈单止盈率": 0
                },
                {
                    "模式档位名称": "买五",
                    "平衡模式数量(股)": 0,
                    "平衡模式距离基准最小距离": 0.005,
                    "平衡模式波动容忍价格": 0.002,
                    "平衡模式止盈单止盈率": 0,
                    "轻微偏向买数量(股)": 0,
                    "轻微偏向买距离基准最小距离": 0.005,
                    "轻微偏向买波动容忍价格": 0,
                    "轻微偏向买止盈单止盈率": 0,
                    "轻微偏向卖数量(股)": 0,
                    "轻微偏向卖距离基准最小距离": 0.005,
                    "轻微偏向卖波动容忍价格": 0,
                    "轻微偏向卖止盈单止盈率": 0,
                    "强烈偏向买数量(股)": 0,
                    "强烈偏向买距离基准最小距离": 0.005,
                    "强烈偏向买波动容忍价格": 0,
                    "强烈偏向买止盈单止盈率": 0,
                    "强烈偏向卖数量(股)": 0,
                    "强烈偏向卖距离基准最小距离": 0.005,
                    "强烈偏向卖波动容忍价格": 0,
                    "强烈偏向卖止盈单止盈率": 0
                }
            ]
        }
    }
}


data1 = {
    "vesion_alias": "xgboost_deep",
    "data_config": {
        # aaaaaa
        "train_start_time": "20200101",
        # fda    sfasdf
        "symbol": symbol,
        "train_end_time": "20220201",
        "valid_start_time": "20221202",
        "valid_end_time": "20230321",
        "test_start_time":
            "20230322",
        "test_end_time": "20230804",
        "main_stocks": symbol,
        "w_size": 1,
        "n_job": 2,
        "transform": True,
        "clip_type": "3sigma",
        "scaler_type": "z-score",
        "quantile": [0.02, 0.98],
        "factor_name_list": [],  # 按条数筛选后写入
        "tagger_name_list":
            ["labelEQtriplebarriertaggerv2pricetypeEQmidpricedsizeEQ120barrierEQ1"],
        "tagger_limit": 50,
        "raw_name_list": [],
        "model_dir": os.path.join(exp_path, "saved_models/"),
        "thres": [0.02, 0.02],
        # 因子候选集, factor_select 是在这里的因子选
        # "factor_pool": "/data/user/019771/star_project/exp_result/688223.SH_trade_v1.1/factor_pool.csv",
        # 也可是public或personal
        "data_source": "{}_factor_df.parquet".format(
            symbol[:-3]),
        "label_source": "label_{}.parquet".format(symbol),
        # 不以Factor开头但是也能放进来的列表
        "other_factor_list": "",
        # 因子列表， 为空的话为全量
        "factor_json_path": "",
        # 因子黑名单列表，不能用的因子
        "exclude_json_path": "/data/user/013150/online_scripts/Signal_Pipeline/factor_exclude.json"},
    # 模型段配置
    "xgb_config": {
        'objective': "reg:squarederror",
        'booster': 'gbtree',
        'tree_method': 'gpu_hist',
        'gamma': 0.5,
        'learning_rate': 0.01,
        'lambda': 2,
        'subsample': 0.7,
        'colsample_bytree': 0.7,
        'max_depth': 14,
        'n_estimators': 3000,
        'seed': 4},
    "metrics": {"指标": [1.0, 3.0],
                "reg_eval_th": 0.5},
    "model": {"name": "mlp"},
    "optimizer": {"name": "adam", "lr": 0.001, },
    "criterion": {"name": "mse"},
    "model_dir": os.path.join(exp_path, "saved_models/"),
    "Model_save_mode": ["pkl", "onnx"],
    "n_jobs_model": 32,

    "path_config": {
        "Exp_path": exp_path,
        "model_saved_path": os.path.join(exp_path, "saved_models/"),
        "dataset_saved_path": os.path.join(exp_path, "dataset"),
        "signal_saved_path": os.path.join(exp_path, "signal_files/"),
        "signal_saved_txt_path": os.path.join(exp_path, "signal_files_txt/"),
        # datapath = os.path.join(config["path_config"]["signal_saved_path"], "th{}_probs{}/test/".format(th1, probs))
        # plt.savefig(os.path.join(config["path_config"]["plot_saved_path"], 'local_th{}_probs{}.png'.format(th1, probs)),
        # sig_path = os.path.join(config["path_config"]["signal_saved_txt_path"], "th{}_probs{}/test".format(th1, probs))
        "plot_saved_path": os.path.join(exp_path, "plot_files"),
        "backtest_saved_path": os.path.join(exp_path, "backtest")
        # os.path.join(config["path_config"]["backtest_saved_path"], "ats")
        # os.path.join(config["path_config"]["backtest_saved_path"], "xbrain")
    }
}

# data1 = copy.deepcopy(data)
# data1["path_config"]["Exp_path"]="111"
# data1["n_jobs_model"]="32"
a = json.dumps(data, sort_keys=True, separators=(',', ':'), allow_nan=False)
b = json.dumps(data1, sort_keys=True, separators=(',', ':'), allow_nan=False)
print(b)
assert a == b

hash1 = hashlib.sha256(a.encode()).hexdigest()
hash2 = hashlib.sha256(b.encode()).hexdigest()
print("hash1:", hash1)
assert hash1 == hash2


