#-*- coding:utf-8 -*-
# author: 015629
# datetime:2020/3/3 16:42

MARKET_TYPE = ["ALLA", "ALLA_HIS"]

INDEX_TYPE = ["SZ50", "HS300", "ZZ500"]

# Industry_type
CITICS = "CITICS"
SW = "SW"
SHENWAN = ""
INDUSTRY_TYPE = ["CITICS", "SW", "SHENWAN"]
LEVEL = [1, 2]
LEVEL_MAP = {1: "I", 2: "II"}

CITICS_I_NAME = ['石油石化', '煤炭', '有色金属', '电力及公用事业', '钢铁', '基础化工', '建筑', '建材', '轻工制造', '机械',
                 '电力设备及新能源', '国防军工', '汽车', '商贸零售', '消费者服务', '家电', '纺织服装', '医药', '食品饮料', '农林牧渔',
                 '银行', '非银行金融', '房地产', '交通运输', '电子', '通信', '计算机', '传媒', '综合', '综合金融']

CITICS_I_CODE = ['b101', 'b102', 'b103', 'b104', 'b105', 'b106', 'b107', 'b108', 'b109', 'b10a',
                 'b10b', 'b10c', 'b10d', 'b10e', 'b10f', 'b10g', 'b10h', 'b10i', 'b10j', 'b10k',
                 'b10l', 'b10m', 'b10n', 'b10o', 'b10p', 'b10q', 'b10r', 'b10s', 'b10t', 'b10u']

CITICS_II_NAME = ['石油开采Ⅱ', '石油化工', '油服工程', '煤炭开采洗选', '煤炭化工', '贵金属', '工业金属', '稀有金属', '发电及电网', '环保及公用事业',
                  '普钢', '其他钢铁', '特材', '农用化工', '化学纤维', '化学原料', '其他化学制品Ⅱ', '塑料及制品', '橡胶及制品', '建筑施工',
                  '建筑装修Ⅱ', '建筑设计及服务Ⅱ', 'NAN', 'NAN', 'NAN', '结构材料', '装饰材料', '专用材料Ⅱ', '造纸Ⅱ', '包装印刷',
                  '家居', '文娱轻工Ⅱ', '其他轻工Ⅱ', '工程机械Ⅱ', '专用机械', '通用设备', '运输设备', '仪器仪表Ⅱ', '金属制品Ⅱ', 'NAN',
                  '电气设备', '电源设备', '新能源动力系统', '航空航天', '兵器兵装Ⅱ', '其他军工Ⅱ', '乘用车Ⅱ', '商用车', '汽车零部件Ⅱ', '汽车销售及服务Ⅱ',
                  '摩托车及其他Ⅱ', '一般零售', '贸易Ⅱ', '专营连锁', '电商及服务Ⅱ', '专业市场经营Ⅱ', '旅游及休闲', '酒店及餐饮', '教育', '综合服务',
                  '白色家电Ⅱ', '黑色家电Ⅱ', '小家电Ⅱ', '照明电工及其他', '厨房电器Ⅱ', '纺织制造', '品牌服饰', '化学制药', '中药生产', '生物医药Ⅱ',
                  '其他医药医疗', '酒类', '饮料', '食品', '种植业', '畜牧业', '林业', '渔业', '农产品加工Ⅱ', '国有大型银行Ⅱ',
                  '全国性股份制银行Ⅱ', '区域性银行', '证券Ⅱ', '保险Ⅱ', '多元金融', '房地产开发和运营', '房地产服务', '公路铁路', '公交物流', '航运港口',
                  '航空机场', '半导体', 'NAN', '元器件', '光学光电', '消费电子', '其他电子零组件Ⅱ', '电信运营Ⅱ', '通信设备制造', '增值服务Ⅱ',
                  '通讯工程服务', '计算机设备', '计算机软件', 'NAN', '云服务', '产业互联网', '媒体', '广告营销', '文化娱乐', '互联网媒体',
                  '综合Ⅱ', '资产管理Ⅱ', '多领域控股Ⅱ', '新兴金融服务Ⅱ']

CITICS_II_CODE = ['b10101', 'b10102', 'b10103', 'b10201', 'b10202', 'b10301', 'b10302', 'b10303', 'b10401', 'b10402',
                  'b10501', 'b10502', 'b10503', 'b10601', 'b10602', 'b10603', 'b10604', 'b10605', 'b10606', 'b10701',
                  'b10702', 'b10703', 'b10801', 'b10802', 'b10803', 'b10804', 'b10805', 'b10806', 'b10901', 'b10902',
                  'b10903', 'b10904', 'b10905', 'b10a01', 'b10a02', 'b10a03', 'b10a04', 'b10a05', 'b10a06', 'b10b01',
                  'b10b02', 'b10b03', 'b10b04', 'b10c01', 'b10c02', 'b10c03', 'b10d01', 'b10d02', 'b10d03', 'b10d04',
                  'b10d05', 'b10e01', 'b10e02', 'b10e03', 'b10e04', 'b10e05', 'b10f01', 'b10f02', 'b10f03', 'b10f04',
                  'b10g01', 'b10g02', 'b10g03', 'b10g04', 'b10g05', 'b10h04', 'b10h05', 'b10i01', 'b10i02', 'b10i03',
                  'b10i04', 'b10j01', 'b10j02', 'b10j03', 'b10k01', 'b10k02', 'b10k03', 'b10k04', 'b10k05', 'b10l01',
                  'b10l02', 'b10l03', 'b10m01', 'b10m02', 'b10m03', 'b10n01', 'b10n02', 'b10o01', 'b10o02', 'b10o03',
                  'b10o04', 'b10p01', 'b10p02', 'b10p03', 'b10p04', 'b10p05', 'b10p06', 'b10q01', 'b10q02', 'b10q03',
                  'b10q04', 'b10r01', 'b10r02', 'b10r03', 'b10r04', 'b10r05', 'b10s01', 'b10s02', 'b10s03', 'b10s04',
                  'b10t01', 'b10u01', 'b10u02', 'b10u03']

SW_I_NAME = ['农林牧渔', '采掘', '化工', '钢铁', '有色金属', '电子', '家用电器', '食品饮料', '纺织服装', '轻工制造', '医药生物', '公用事业',
             '交通运输', '房地产', '商业贸易', '休闲服务', '综合', '建筑材料', '建筑装饰', '电气设备', '机械设备', '国防军工', '汽车', '计算机',
             '传媒', '通信', '银行', '非银金融']

SW_I_CODE = ['6101', '6102', '6103', '6104', '6105', '6108', '6111', '6112', '6113', '6114', '6115', '6116',
             '6117', '6118', '6120', '6121', '6123', '6124', '6125', '6126', '6127', '6128', '6129', '6130',
             '6131', '6132', '6133', '6134']

SW_II_NAME = ['林业Ⅱ', '农产品加工', '农业综合Ⅱ', '饲料Ⅱ', '渔业', '种植业', '畜禽养殖Ⅱ', '动物保健Ⅱ', '煤炭开采Ⅱ', '其他采掘Ⅱ',
              '石油开采Ⅱ', '采掘服务Ⅱ', '化学纤维', '化学原料', '化学制品', '石油化工', '塑料Ⅱ', '橡胶', '钢铁Ⅱ', '金属非金属新材料',
              '工业金属', '黄金Ⅱ', '稀有金属', '半导体', '其他电子Ⅱ', '元件Ⅱ', '光学光电子', '电子制造Ⅱ', '白色家电', '视听器材',
              '饮料制造', '食品加工', '纺织制造', '服装家纺', '包装印刷Ⅱ', '家用轻工', '造纸Ⅱ', '其他轻工制造Ⅱ', '化学制药', '生物制品Ⅱ',
              '医疗器械Ⅱ', '医药商业Ⅱ', '中药Ⅱ', '医疗服务Ⅱ', '电力', '环保工程及服务Ⅱ', '燃气Ⅱ', '水务Ⅱ', '港口Ⅱ', '公交Ⅱ',
              '航空运输Ⅱ', '机场Ⅱ', '高速公路Ⅱ', '航运Ⅱ', '铁路运输Ⅱ', '物流Ⅱ', '房地产开发Ⅱ', '园区开发Ⅱ', '贸易Ⅱ', '一般零售',
              '专业零售', '商业物业经营', '餐饮Ⅱ', '景点', '酒店Ⅱ', '旅游综合Ⅱ', '其他休闲服务Ⅱ', '综合Ⅱ', '水泥制造Ⅱ', '玻璃制造Ⅱ',
              '其他建材Ⅱ', '房屋建设Ⅱ', '装修装饰Ⅱ', '园林工程Ⅱ', '基础建设', '专业工程', '电机Ⅱ', '电气自动化设备', '电源设备', '高低压设备',
              '通用机械', '专用设备', '仪器仪表Ⅱ', '金属制品Ⅱ', '运输设备Ⅱ', '航天装备Ⅱ', '航空装备Ⅱ', '地面兵装Ⅱ', '船舶制造Ⅱ', '汽车整车',
              '汽车零部件Ⅱ', '汽车服务Ⅱ', '其他交运设备Ⅱ', '计算机设备Ⅱ', '计算机应用', '文化传媒', '营销传播', '互联网传媒', '通信运营Ⅱ', '通信设备',
              '银行Ⅱ', '证券Ⅱ', '保险Ⅱ', '多元金融Ⅱ']

SW_II_CODE = ['610101', '610102', '610103', '610104', '610105', '610106', '610107', '610108', '610201', '610202',
              '610203', '610204', '610302', '610303', '610304', '610305', '610306', '610307', '610401', '610501',
              '610503', '610504', '610505', '610801', '610802', '610803', '610804', '610805', '611101', '611102',
              '611203', '611204', '611301', '611302', '611401', '611402', '611403', '611404', '611501', '611502',
              '611503', '611504', '611505', '611506', '611601', '611602', '611603', '611604', '611701', '611702',
              '611703', '611704', '611705', '611706', '611707', '611708', '611801', '611802', '612002', '612003',
              '612004', '612005', '612101', '612102', '612103', '612104', '612105', '612301', '612401', '612402',
              '612403', '612501', '612502', '612503', '612504', '612505', '612601', '612602', '612603', '612604',
              '612701', '612702', '612703', '612704', '612705', '612801', '612802', '612803', '612804', '612901',
              '612902', '612903', '612904', '613001', '613002', '613101', '613102', '613103', '613201', '613202',
              '613301', '613401', '613402', '613403']

SHENWAN_I_NAME = ['农林牧渔', '采掘', '化工', '钢铁', '有色金属', '电子', '家用电器', '食品饮料', '纺织服装', '轻工制造', '医药生物', '公用事业',
                  '交通运输', '房地产', '商业贸易', '休闲服务', '综合', '建筑材料', '建筑装饰', '电气设备', '机械设备', '国防军工', '汽车', '计算机',
                  '传媒', '通信', '银行', '非银金融']

SHENWAN_I_CODE = ['801010.SI', '801020.SI', '801030.SI', '801040.SI', '801050.SI', '801080.SI', '801110.SI', '801120.SI', '801130.SI', '801140.SI', '801150.SI', '801160.SI',
                  '801170.SI', '801180.SI', '801200.SI', '801210.SI', '801230.SI', '801710.SI', '801720.SI', '801730.SI', '801890.SI', '801740.SI', '801880.SI', '801750.SI',
                  '801760.SI', '801770.SI', '801780.SI', '801790.SI']

SHENWAN_II_NAME = ['林业Ⅱ', '农产品加工', '农业综合Ⅱ', '饲料Ⅱ', '渔业', '种植业', '畜禽养殖Ⅱ', '动物保健Ⅱ', '煤炭开采Ⅱ', '其他采掘Ⅱ',
                   '石油开采Ⅱ', '采掘服务Ⅱ', '化学纤维', '化学原料', '化学制品', '石油化工', '塑料Ⅱ', '橡胶', '钢铁Ⅱ', '金属非金属新材料',
                   '工业金属', '黄金Ⅱ', '稀有金属', '半导体', '其他电子Ⅱ', '元件Ⅱ', '光学光电子', '电子制造Ⅱ', '白色家电', '视听器材',
                   '饮料制造', '食品加工', '纺织制造', '服装家纺', '包装印刷Ⅱ', '家用轻工', '造纸Ⅱ', '其他轻工制造Ⅱ', '化学制药', '生物制品Ⅱ',
                   '医疗器械Ⅱ', '医药商业Ⅱ', '中药Ⅱ', '医疗服务Ⅱ', '电力', '环保工程及服务Ⅱ', '燃气Ⅱ', '水务Ⅱ', '港口Ⅱ', '公交Ⅱ',
                   '航空运输Ⅱ', '机场Ⅱ', '高速公路Ⅱ', '航运Ⅱ', '铁路运输Ⅱ', '物流Ⅱ', '房地产开发Ⅱ', '园区开发Ⅱ', '贸易Ⅱ', '一般零售',
                   '专业零售', '商业物业经营', '餐饮Ⅱ', '景点', '酒店Ⅱ', '旅游综合Ⅱ', '其他休闲服务Ⅱ', '综合Ⅱ', '水泥制造Ⅱ', '玻璃制造Ⅱ',
                   '其他建材Ⅱ', '房屋建设Ⅱ', '装修装饰Ⅱ', '园林工程Ⅱ', '基础建设', '专业工程', '电机Ⅱ', '电气自动化设备', '电源设备', '高低压设备',
                   '通用机械', '专用设备', '仪器仪表Ⅱ', '金属制品Ⅱ', '运输设备Ⅱ', '航天装备Ⅱ', '航空装备Ⅱ', '地面兵装Ⅱ', '船舶制造Ⅱ', '汽车整车',
                   '汽车零部件Ⅱ', '汽车服务Ⅱ', '其他交运设备Ⅱ', '计算机设备Ⅱ', '计算机应用', '文化传媒', '营销传播', '互联网传媒', '通信运营Ⅱ', '通信设备',
                   '银行Ⅱ', '证券Ⅱ', '保险Ⅱ', '多元金融Ⅱ']

SHENWAN_II_CODE = ['801011.SI', '801012.SI', '801013.SI', '801014.SI', '801015.SI', '801016.SI', '801017.SI', '801018.SI', '801021.SI', '801022.SI',
                   '801023.SI', '801024.SI', '801032.SI', '801033.SI', '801034.SI', '801035.SI', '801036.SI', '801037.SI', '801041.SI', '801051.SI',
                   '801055.SI', '801053.SI', '801054.SI', '801081.SI', '801082.SI', '801083.SI', '801084.SI', '801085.SI', '801111.SI', '801112.SI',
                   '801123.SI', '801124.SI', '801131.SI', '801132.SI', '801141.SI', '801142.SI', '801143.SI', '801144.SI', '801151.SI', '801152.SI',
                   '801153.SI', '801154.SI', '801155.SI', '801156.SI', '801161.SI', '801162.SI', '801163.SI', '801164.SI', '801171.SI', '801172.SI',
                   '801173.SI', '801174.SI', '801175.SI', '801176.SI', '801177.SI', '801178.SI', '801181.SI', '801182.SI', '801202.SI', '801203.SI',
                   '801204.SI', '801205.SI', '801211.SI', '801212.SI', '801213.SI', '801214.SI', '801215.SI', '801231.SI', '801711.SI', '801712.SI',
                   '801713.SI', '801721.SI', '801722.SI', '801725.SI', '801723.SI', '801724.SI', '801731.SI', '801732.SI', '801733.SI', '801734.SI',
                   '801072.SI', '801074.SI', '801073.SI', '801075.SI', '801076.SI', '801741.SI', '801742.SI', '801743.SI', '801744.SI', '801094.SI',
                   '801093.SI', '801092.SI', '801881.SI', '801101.SI', '801222.SI', '801761.SI', '801751.SI', '801752.SI', '801223.SI', '801102.SI',
                   '801192.SI', '801193.SI', '801194.SI', '801191.SI']

SHENWAN_SW_MAP = {code: SW_I_CODE[SHENWAN_I_CODE.index(code)] for code in SHENWAN_I_CODE}
SHENWAN_SW_MAP.update({code: SW_II_CODE[SHENWAN_II_CODE.index(code)] for code in SHENWAN_II_CODE})
SW_SHENWAN_MAP = {value: key for key, value in SHENWAN_SW_MAP.items()}

HSET_HBASE_COLUMNS = ["StockSet"]
INDUSTRY_HBASE_COLUMNS = [indus + LEVEL_MAP[l] + "Code" for indus in INDUSTRY_TYPE for l in LEVEL]
HSI_HBASE_COLUMNS = ["Stock"] + INDUSTRY_HBASE_COLUMNS

### 中信一级行业变种，非银行金融拆分为三个二级行业： '证券Ⅱ', '保险Ⅱ', '信托及其他'
CITICS_I_VAR_NAME = ['石油石化', '煤炭', '有色金属', '电力及公用事业', '钢铁', '基础化工', '建筑', '建材', '轻工制造', '机械', '电力设备', '国防军工',
                     '汽车', '商贸零售', '餐饮旅游', '家电', '纺织服装', '医药', '食品饮料', '农林牧渔', '银行', '证券Ⅱ', '保险Ⅱ', '信托及其他',
                     '房地产', '交通运输', '电子元器件', '通信', '计算机', '传媒', '综合', '综合金融']

CITICS_I_VAR_CODE = ["b101", "b102", "b103", "b104", "b105", "b106", "b107", "b108", "b109", "b10a", "b10b", "b10c",
                     "b10d", "b10e", "b10f", "b10g", "b10h", "b10i", "b10j", "b10k", "b10l", "b10m01", "b10m02", "b10m03",
                     "b10n", "b10o", "b10p", "b10q", "b10r", "b10s", "b10t", 'b10u']

CBOND_STOCK_HBASE_COLUMNS = ["CSMapCBond", "CSMapStock"]

# Index Future
INDEX_FUTURE_CODE = ["IF", "IC", "IH"]
INDEX_FUTURE_HBASE_COLUMNS = ["MainContract", "SubMainContract", "AllContract"]

