INDEX_LIST = ['000001.SH',  # SZZZ：上证综指
              '000016.SH',  # SZ50：上证50
              '000300.SH',  # HS300：沪深300
              '000905.SH',  # ZZ500：中证500
              '000906.SH',  # ZZ800：中证800
              #'000985.SH',  # ZZQZ: 中证全指, 日频数据接口里面代码为：000985.CSI
              '000852.SH',  # ZZ1000：中证1000
              '399001.SZ',  # SZCZ：深证成指
              '399005.SZ',  # ZXBZ：中小板指
              '399006.SZ',  # CYBZ：创业板指
              ### 以下为申万指数
              # '801003.SI',  # '申万Ａ指'
              # '801300.SI',  # '申万300指数'
              # '801002.SI',  # '申万中小板'
              # '801005.SI',  # '申万创业板'
              # '801001.SI',  # '申万50'
              # '801811.SI',  # '大盘指数'
              # '801812.SI',  # '中盘指数'
              # '801813.SI',  # '小盘指数'
              # '801821.SI',  # '高市盈率指数'
              # '801822.SI',  # '中市盈率指数'
              # '801823.SI',  # '低市盈率指数'
              # '801853.SI',  # '绩优股指数'
              # '801852.SI',  # '微利股指数'
              # '801851.SI',  # '亏损股指数'
              # '801841.SI',  # '高价股指数'
              # '801842.SI',  # '中价股指数'
              # '801843.SI',  # '低价股指数'
              # '801831.SI',  # '高市净率指数'
              # '801832.SI',  # '中市净率指数'
              # '801833.SI',  # '低市净率指数'
              # '801863.SI',  # '新股指数'
              # '801250.SI',  # '申万制造'
              # '801280.SI',  # '申万服务'
              # '801270.SI',  # '申万投资'
              # '801260.SI',  # '申万消费'
              # '802600.SI',  # '交银装备'
              ### 中证转债指数
              '000832.SH'   # '中证转债指数'
              ]

SHENWAN_INDEX_LIST = ['801003.SI',  # '申万Ａ指'
                      '801300.SI',  # '申万300指数'
                      '801002.SI',  # '申万中小板'
                      '801005.SI',  # '申万创业板'
                      '801001.SI',  # '申万50'
                      '801811.SI',  # '大盘指数'
                      '801812.SI',  # '中盘指数'
                      '801813.SI',  # '小盘指数'
                      '801821.SI',  # '高市盈率指数'
                      '801822.SI',  # '中市盈率指数'
                      '801823.SI',  # '低市盈率指数'
                      '801853.SI',  # '绩优股指数'
                      '801852.SI',  # '微利股指数'
                      '801851.SI',  # '亏损股指数'
                      '801841.SI',  # '高价股指数'
                      '801842.SI',  # '中价股指数'
                      '801843.SI',  # '低价股指数'
                      '801831.SI',  # '高市净率指数'
                      '801832.SI',  # '中市净率指数'
                      '801833.SI',  # '低市净率指数'
                      '801863.SI',  # '新股指数'
                      '801250.SI',  # '申万制造'
                      '801280.SI',  # '申万服务'
                      '801270.SI',  # '申万投资'
                      '801260.SI',  # '申万消费'
                      '802600.SI',  # '交银装备'
              ]

THIRD_INDEX_LIST = ['000832.SH' # '中证转债指数'
                   ]
